{"weightsManifest": [{"weights": [{"shape": [60, 4103], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [4103], "name": "dense_1/bias", "dtype": "float32"}], "paths": ["group1-shard1of1"]}, {"weights": [{"shape": [4103, 120], "name": "embedding_1/embeddings", "dtype": "float32"}], "paths": ["group2-shard1of1"]}, {"weights": [{"shape": [120, 240], "name": "lstm_1/kernel", "dtype": "float32"}, {"shape": [60, 240], "name": "lstm_1/recurrent_kernel", "dtype": "float32"}, {"shape": [240], "name": "lstm_1/bias", "dtype": "float32"}], "paths": ["group3-shard1of1"]}], "modelTopology": {"training_config": {"metrics": ["sparse_categorical_accuracy"], "loss": "sparse_categorical_crossentropy", "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "RMSprop", "config": {"decay": 0.0, "lr": 0.004999999888241291, "rho": 0.8999999761581421, "epsilon": 1e-07}}}, "backend": "tensorflow", "keras_version": "2.1.6", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "mask_zero": false, "embeddings_regularizer": null, "embeddings_constraint": null, "input_length": null, "trainable": true, "batch_input_shape": [null, null], "input_dim": 4103, "output_dim": 120, "dtype": "float32", "name": "embedding_1", "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"bias_constraint": null, "kernel_regularizer": null, "dropout": 0.0, "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "units": 60, "return_state": false, "trainable": true, "recurrent_regularizer": null, "implementation": 1, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "unroll": false, "return_sequences": true, "activation": "tanh", "name": "lstm_1", "recurrent_constraint": null}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.2}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "units": 4103, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "softmax", "name": "dense_1", "activity_regularizer": null}}]}}}