{"modelTopology": {"keras_version": "2.1.4", "backend": "tensorflow", "model_config": {"config": [{"config": {"trainable": true, "input_length": null, "batch_input_shape": [null, null], "mask_zero": false, "activity_regularizer": null, "name": "embedding_1", "embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "embeddings_regularizer": null, "output_dim": 200, "embeddings_constraint": null, "dtype": "float32", "input_dim": 7503}, "class_name": "Embedding"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "implementation": 1, "unroll": false, "go_backwards": false, "kernel_regularizer": null, "unit_forget_bias": true, "dropout": 0.0, "use_bias": true, "trainable": true, "recurrent_dropout": 0.0, "recurrent_constraint": null, "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "stateful": false, "return_sequences": true, "bias_constraint": null, "units": 120, "activation": "tanh", "recurrent_regularizer": null}, "class_name": "LSTM"}, {"config": {"seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 7503, "activation": "softmax", "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}, "training_config": {"metrics": ["sparse_categorical_accuracy"], "loss": "sparse_categorical_crossentropy", "optimizer_config": {"config": {"epsilon": 1e-07, "decay": 0.0, "amsgrad": false, "beta_2": 0.9990000128746033, "beta_1": 0.8999999761581421, "lr": 0.0010000000474974513}, "class_name": "Adam"}, "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "dense_1/kernel", "dtype": "float32", "shape": [120, 7503]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [7503]}]}, {"paths": ["group2-shard1of2", "group2-shard2of2"], "weights": [{"name": "embedding_1/embeddings", "dtype": "float32", "shape": [7503, 200]}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "lstm_1/kernel", "dtype": "float32", "shape": [200, 480]}, {"name": "lstm_1/recurrent_kernel", "dtype": "float32", "shape": [120, 480]}, {"name": "lstm_1/bias", "dtype": "float32", "shape": [480]}]}]}