{"weightsManifest": [{"weights": [{"name": "dense_1/kernel", "dtype": "float32", "shape": [100, 4103]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [4103]}], "paths": ["group1-shard1of1"]}, {"weights": [{"name": "embedding_1/embeddings", "dtype": "float32", "shape": [4103, 200]}], "paths": ["group2-shard1of1"]}, {"weights": [{"name": "gru_1/kernel", "dtype": "float32", "shape": [200, 300]}, {"name": "gru_1/recurrent_kernel", "dtype": "float32", "shape": [100, 300]}, {"name": "gru_1/bias", "dtype": "float32", "shape": [300]}], "paths": ["group3-shard1of1"]}], "modelTopology": {"backend": "tensorflow", "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": ["sparse_categorical_accuracy"], "sample_weight_mode": null, "optimizer_config": {"config": {"epsilon": 1e-07, "decay": 0.0, "lr": 0.0020000000949949026, "rho": 0.8999999761581421}, "class_name": "RMSprop"}, "loss_weights": null}, "model_config": {"config": [{"config": {"output_dim": 200, "dtype": "float32", "input_dim": 4103, "trainable": true, "activity_regularizer": null, "mask_zero": false, "embeddings_regularizer": null, "embeddings_initializer": {"config": {"maxval": 0.05, "seed": null, "minval": -0.05}, "class_name": "RandomUniform"}, "batch_input_shape": [null, null], "embeddings_constraint": null, "input_length": null, "name": "embedding_1"}, "class_name": "Embedding"}, {"config": {"unroll": false, "activation": "tanh", "recurrent_regularizer": null, "dropout": 0.0, "trainable": true, "kernel_constraint": null, "units": 100, "bias_regularizer": null, "kernel_regularizer": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid", "reset_after": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "return_sequences": true, "stateful": false, "return_state": false, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "implementation": 1, "name": "gru_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false}, "class_name": "GRU"}, {"config": {"noise_shape": null, "rate": 0.2, "trainable": true, "seed": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"units": 4103, "use_bias": true, "kernel_constraint": null, "trainable": true, "activation": "softmax", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1"}, "class_name": "Dense"}], "class_name": "Sequential"}, "keras_version": "2.1.6"}}