{"modelTopology": {"training_config": {"loss": "sparse_categorical_crossentropy", "optimizer_config": {"config": {"beta_2": 0.9990000128746033, "decay": 0.0, "beta_1": 0.8999999761581421, "lr": 0.0010000000474974513, "epsilon": 1e-07, "amsgrad": false}, "class_name": "Adam"}, "metrics": ["sparse_categorical_accuracy"], "sample_weight_mode": null, "loss_weights": null}, "keras_version": "2.1.4", "backend": "tensorflow", "model_config": {"config": [{"config": {"dtype": "float32", "mask_zero": false, "input_length": null, "embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "input_dim": 7503, "embeddings_regularizer": null, "output_dim": 200, "name": "embedding_1", "embeddings_constraint": null, "batch_input_shape": [null, null], "trainable": true, "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"stateful": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "go_backwards": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null, "return_sequences": true, "units": 120, "activity_regularizer": null, "activation": "tanh", "bias_constraint": null, "recurrent_dropout": 0.0, "use_bias": true, "recurrent_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "unroll": false, "implementation": 1, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "name": "lstm_1", "dropout": 0.0, "recurrent_regularizer": null, "trainable": true}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "seed": null, "trainable": true, "rate": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "units": 7503, "trainable": true, "activity_regularizer": null, "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential"}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [120, 7503], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [7503], "name": "dense_1/bias"}]}, {"paths": ["group2-shard1of2", "group2-shard2of2"], "weights": [{"dtype": "float32", "shape": [7503, 200], "name": "embedding_1/embeddings"}]}, {"paths": ["group3-shard1of1"], "weights": [{"dtype": "float32", "shape": [200, 480], "name": "lstm_1/kernel"}, {"dtype": "float32", "shape": [120, 480], "name": "lstm_1/recurrent_kernel"}, {"dtype": "float32", "shape": [480], "name": "lstm_1/bias"}]}]}