{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "dense_2/kernel", "shape": [64, 8874], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [8874], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "lstm_1/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "lstm_1/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "lstm_1/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "time_distributed_1/kernel", "shape": [64, 1], "dtype": "float32"}, {"name": "time_distributed_1/bias", "shape": [1], "dtype": "float32"}]}], "modelTopology": {"keras_version": "2.1.6", "model_config": {"class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 256], "sparse": false, "name": "input_1", "dtype": "float32"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lstm_1", "class_name": "LSTM", "config": {"kernel_constraint": null, "name": "lstm_1", "activity_regularizer": null, "trainable": true, "dtype": "float32", "recurrent_regularizer": null, "kernel_regularizer": null, "stateful": false, "implementation": 1, "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, null, 256], "go_backwards": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "recurrent_constraint": null, "return_sequences": true, "activation": "tanh", "unit_forget_bias": true, "bias_constraint": null, "units": 64, "dropout": 0.0, "use_bias": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "return_state": false}}, {"inbound_nodes": [[["lstm_1", 0, 0, {}]]], "name": "time_distributed_1", "class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "activation": "softmax", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null}}, "name": "time_distributed_1", "trainable": true}}, {"inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "name": "lambda_1", "class_name": "Lambda", "config": {"output_shape": null, "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcw0AAAB0AABqAQB8AACDAQBTKQFOKQLaAUvaDWJhdGNoX2Zs\nYXR0ZW4pAdoBeKkAcgQAAAD6C3JubnN0dWNrLnB52gg8bGFtYmRhPtQAAABzAAAAAA==\n", null, null], "name": "lambda_1", "arguments": {}, "trainable": true, "output_shape_type": "raw", "function_type": "lambda"}}, {"inbound_nodes": [[["lambda_1", 0, 0, {}]]], "name": "repeat_vector_1", "class_name": "RepeatVector", "config": {"n": 64, "name": "repeat_vector_1", "trainable": true}}, {"inbound_nodes": [[["repeat_vector_1", 0, 0, {}]]], "name": "permute_1", "class_name": "Permute", "config": {"trainable": true, "name": "permute_1", "dims": [2, 1]}}, {"inbound_nodes": [[["lstm_1", 0, 0, {}], ["permute_1", 0, 0, {}]]], "name": "multiply_1", "class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true}}, {"inbound_nodes": [[["multiply_1", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 8874, "bias_regularizer": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "activation": "softmax", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null}}], "output_layers": [["dense_2", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "sample_weight_mode": null, "optimizer_config": {"class_name": "SGD", "config": {"momentum": 0.8999999761581421, "decay": 0.0, "lr": 0.004999999888241291, "nesterov": true}}, "metrics": ["sparse_categorical_accuracy"], "loss_weights": null}, "backend": "tensorflow"}}