{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "name": "dense_1/kernel", "shape": [32, 8586]}, {"dtype": "float32", "name": "dense_1/bias", "shape": [8586]}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "name": "lstm_1/kernel", "shape": [200, 128]}, {"dtype": "float32", "name": "lstm_1/recurrent_kernel", "shape": [32, 128]}, {"dtype": "float32", "name": "lstm_1/bias", "shape": [128]}]}], "modelTopology": {"keras_version": "2.1.4", "training_config": {"optimizer_config": {"class_name": "SGD", "config": {"lr": 0.20000000298023224, "decay": 9.999999747378752e-05, "momentum": 0.8999999761581421, "nesterov": true}}, "loss_weights": null, "sample_weight_mode": null, "metrics": ["sparse_categorical_accuracy"], "loss": "sparse_categorical_crossentropy"}, "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_regularizer": null, "go_backwards": false, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "recurrent_constraint": null, "name": "lstm_1", "trainable": true, "kernel_regularizer": null, "units": 32, "batch_input_shape": [null, null, 200], "kernel_constraint": null, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "recurrent_dropout": 0.0, "activation": "tanh", "implementation": 1, "return_sequences": true, "unit_forget_bias": true, "stateful": false, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "recurrent_regularizer": null, "use_bias": true, "return_state": false}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "activation": "softmax", "activity_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "units": 8586, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null}}]}}}