{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [72, 8671], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [8671], "name": "dense_1/bias", "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"shape": [200, 288], "name": "lstm_1/kernel", "dtype": "float32"}, {"shape": [72, 288], "name": "lstm_1/recurrent_kernel", "dtype": "float32"}, {"shape": [288], "name": "lstm_1/bias", "dtype": "float32"}]}], "modelTopology": {"model_config": {"config": [{"config": {"trainable": true, "return_sequences": true, "kernel_constraint": null, "return_state": false, "implementation": 1, "dropout": 0.0, "unit_forget_bias": true, "activity_regularizer": null, "go_backwards": false, "unroll": false, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "batch_input_shape": [null, null, 200], "dtype": "float32", "units": 72, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "name": "lstm_1", "kernel_regularizer": null, "activation": "tanh", "bias_constraint": null, "stateful": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "use_bias": true}, "class_name": "LSTM"}, {"config": {"trainable": true, "bias_regularizer": null, "units": 8671, "name": "dense_1", "kernel_regularizer": null, "activation": "softmax", "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}, "keras_version": "2.1.6", "backend": "tensorflow", "training_config": {"loss": "sparse_categorical_crossentropy", "optimizer_config": {"config": {"nesterov": true, "decay": 9.999999747378752e-05, "lr": 0.10000000149011612, "momentum": 0.8999999761581421}, "class_name": "SGD"}, "metrics": ["sparse_categorical_accuracy"], "sample_weight_mode": null, "loss_weights": null}}}