{"modelTopology": {"model_config": {"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_regularizer": null, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "activity_regularizer": null, "unit_forget_bias": true, "units": 128, "recurrent_constraint": null, "activation": "tanh", "dtype": "float32", "go_backwards": false, "name": "lstm_1", "return_sequences": true, "implementation": 1, "stateful": false, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "batch_input_shape": [null, null, 256], "use_bias": true, "kernel_constraint": null, "unroll": false, "return_state": false, "dropout": 0.0, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "trainable": true, "noise_shape": null, "rate": 0.2}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "units": 7055, "kernel_constraint": null, "activation": "softmax", "kernel_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}]}, "backend": "tensorflow", "training_config": {"loss": "sparse_categorical_crossentropy", "loss_weights": null, "sample_weight_mode": null, "optimizer_config": {"class_name": "Adam", "config": {"decay": 0.0, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "lr": 1.9999999494757503e-05, "amsgrad": false, "beta_1": 0.8999999761581421}}, "metrics": ["sparse_categorical_accuracy"]}, "keras_version": "2.1.6"}, "weightsManifest": [{"weights": [{"name": "dense_1/kernel", "shape": [128, 7055], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [7055], "dtype": "float32"}], "paths": ["group1-shard1of1"]}, {"weights": [{"name": "lstm_1/kernel", "shape": [256, 512], "dtype": "float32"}, {"name": "lstm_1/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_1/bias", "shape": [512], "dtype": "float32"}], "paths": ["group2-shard1of1"]}]}